### Pandas-DataFrame And Series

Pandas is a powerful data manipulation library in Python. widely used for data analysis and data cleaning. it
provides two primary data structures: Seris and Dataframe. A Seris one-dimensional array-like object,
while a Dataframe is a two-dimensional, size-multable, and potentially heterogeneous tabular data structure
with labeled axes(rows and culumns.)

In [3]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\user\appdata\local\programs\python\python310\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.22.4 in c:\users\user\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.2.6)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 23.0.1 -> 25.3
[notice] To update, run: C:\Users\USER\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip

In [4]:
import pandas as pd

ModuleNotFoundError: No module named 'pandas'

In [1]:
!python -m pip install pandas

Collecting pandas
  Downloading pandas-2.3.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp312-cp312-win_amd64.whl (11.0 MB)
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.0 MB 660.6 kB/s eta 0:00:17
   ---------------------------------------- 0.1/11.0 MB 871.5 kB/s eta 0:00:13
   ---------------------------------------- 0.1/11.0 MB 901.1 kB/s eta 0:00:13
    --------------------------------------- 0.2/11.0 MB 1.3 MB/s eta 0:00:09
   - -------------------------------------- 0.5/11.0 MB 2.1 MB/s eta 0:00:05
   --- ------------------------------------ 0.9/11.0 MB 3.0 MB/s eta 0:00:04
   ---- ----------------------------------- 1.2/11.0 MB 3.6 MB/s eta 0:00:03
   ----- ---------------------------------- 1.4/11.0 MB 3.7 MB/s eta 0:00:03
   ------ --------------------------------- 1.7/11.0 MB 4.1 MB/s eta 0:00:03
   ------- -------------------------------- 2.1/11.0 MB 4.4 MB/s eta 0:00:03
   -------- ------------------------------- 2.3/11.0 MB 4.4 MB/s eta 0:00:02
   -------- ------------------------------- 2.5/11.0 MB 4.4 MB/s eta 0:00:02
   --------- ------------------------------ 2.6/11.0 MB 4.3 MB/s eta 0:00:02
   ---------- ----------------------------- 2.9/11.0 MB 4.4 MB/s eta 0:00:02
   ----------- ---------------------------- 3.2/11.0 MB 4.5 MB/s eta 0:00:02
   ------------ --------------------------- 3.5/11.0 MB 4.6 MB/s eta 0:00:02
   ------------- -------------------------- 3.8/11.0 MB 4.7 MB/s eta 0:00:02
   -------------- ------------------------- 4.1/11.0 MB 4.8 MB/s eta 0:00:02
   --------------- ------------------------ 4.1/11.0 MB 4.9 MB/s eta 0:00:02
   --------------- ------------------------ 4.1/11.0 MB 4.9 MB/s eta 0:00:02
   ---------------- ----------------------- 4.5/11.0 MB 4.6 MB/s eta 0:00:02
   ----------------- ---------------------- 4.8/11.0 MB 4.6 MB/s eta 0:00:02
   ------------------ --------------------- 5.1/11.0 MB 4.7 MB/s eta 0:00:02
   ------------------- -------------------- 5.3/11.0 MB 4.7 MB/s eta 0:00:02
   ------------------- -------------------- 5.5/11.0 MB 4.7 MB/s eta 0:00:02
   -------------------- ------------------- 5.7/11.0 MB 4.6 MB/s eta 0:00:02
   --------------------- ------------------ 5.8/11.0 MB 4.6 MB/s eta 0:00:02
   --------------------- ------------------ 5.8/11.0 MB 4.6 MB/s eta 0:00:02
   --------------------- ------------------ 6.0/11.0 MB 4.4 MB/s eta 0:00:02
   ------------------------ --------------- 6.7/11.0 MB 4.8 MB/s eta 0:00:01
   ------------------------- -------------- 7.1/11.0 MB 4.8 MB/s eta 0:00:01
   -------------------------- ------------- 7.4/11.0 MB 4.9 MB/s eta 0:00:01
   --------------------------- ------------ 7.6/11.0 MB 4.9 MB/s eta 0:00:01
   ---------------------------- ----------- 7.9/11.0 MB 5.0 MB/s eta 0:00:01
   ----------------------------- ---------- 8.2/11.0 MB 5.0 MB/s eta 0:00:01
   ------------------------------- -------- 8.5/11.0 MB 5.1 MB/s eta 0:00:01
   ------------------------------- -------- 8.7/11.0 MB 5.0 MB/s eta 0:00:01
   -------------------------------- ------- 8.8/11.0 MB 5.0 MB/s eta 0:00:01
   --------------------------------- ------ 9.1/11.0 MB 5.0 MB/s eta 0:00:01
   --------------------------------- ------ 9.3/11.0 MB 5.0 MB/s eta 0:00:01
   ---------------------------------- ----- 9.5/11.0 MB 5.0 MB/s eta 0:00:01
   ----------------------------------- ---- 9.8/11.0 MB 5.0 MB/s eta 0:00:01
   ------------------------------------ --- 10.0/11.0 MB 5.0 MB/s eta 0:00:01
   ------------------------------------- -- 10.3/11.0 MB 5.2 MB/s eta 0:00:01
   -------------------------------------- - 10.5/11.0 MB 5.3 MB/s eta 0:00:01
   ---------------------------------------  10.8/11.0 MB 5.3 MB/s eta 0:00:01
   ---------------------------------------  11.0/11.0 MB 5.3 MB/s eta 0:00:01
   ---------------------------------------- 11.0/11.0 MB 5.2 MB/s eta 0:00:00
Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Using cached tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.3.3 pytz-2025.2 tzdata-2025.2

[notice] A new release of pip is available: 24.0 -> 25.3
[notice] To update, run: Python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [4]:
## Series
## A pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.

import pandas as pd 
data= [1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
# Create a Series from dictionary
data={'a':1, 'b':2, 'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [6]:
data = [10,20,30]
index=['a', 'b', 'c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [15]:
# Dataframe
## create a Dataframe a dictionary of list

data ={
    'Name': ['Krish', 'John', 'Jack'],
    'Age': [25, 30, 45],
    'City': ['Banglore', 'New York', 'Florida']
}
df= pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New York
2   Jack   45   Florida
<class 'pandas.core.frame.DataFrame'>

In [8]:
import numpy as np
np.array(df)

array([['Krish', 25, 'Banglore'],
       ['John', 30, 'New York'],
       ['Jack', 45, 'Florida']], dtype=object)

In [ ]:
# Create a Data frame a List of Dictionaries

data=[
    {'Name':'Krish', 'Age':25, 'City':'Banglore'},
    {'Name':'John', 'Age':34, 'City':'Banglore'},
    {'Name':'Bappy', 'Age':25, 'City':'Banglore'},
    {'Name':'Jack', 'Age':25, 'City':'Banglore'}
]
df= pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age      City
0  Krish   25  Banglore
1   John   34  Banglore
2  Bappy   25  Banglore
3   Jack   25  Banglore
<class 'pandas.core.frame.DataFrame'>

In [12]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [13]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [17]:
## Accessing Data from Dataframe
df

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New York
2   Jack   45   Florida

In [18]:
df['Name']

0    Krish
1     John
2     Jack
Name: Name, dtype: object

In [21]:
df.loc[0][2]

C:\Users\USER\AppData\Local\Temp\ipykernel_13420\2880214942.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][2]

'Banglore'

In [20]:
df.iloc[0]

Name       Krish
Age           25
City    Banglore
Name: 0, dtype: object

In [22]:
## Accessing  a specific element
df['Name']

0    Krish
1     John
2     Jack
Name: Name, dtype: object

In [23]:
df

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New York
2   Jack   45   Florida

In [24]:
df.at[1,'Age']

np.int64(30)

In [25]:
df.at[1,'Name']

'John'

In [27]:
## Accessing a specific element using iat
df.iat[2,2]

'Florida'

In [29]:
## dta Manipulation with dataframe
df

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New York
2   Jack   45   Florida

In [32]:
## Adding a column
df['Salary']= [50000, 60000, 55000]
df

    Name  Age      City  Salary
0  Krish   25  Banglore   50000
1   John   30  New York   60000
2   Jack   45   Florida   55000

In [39]:
## Remove a column
df.drop('Salary', axis=1, inplace=True)

In [40]:
df

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New York
2   Jack   45   Florida

In [42]:
# ---- Add age to column ----
df['Age']= df['Age'] + 1
df

    Name  Age      City
0  Krish   27  Banglore
1   John   32  New York
2   Jack   47   Florida

In [45]:
df.drop(0, inplace=True)

In [46]:
df

   Name  Age      City
1  John   32  New York
2  Jack   47   Florida

In [47]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [53]:
# Display the data types of each column
print("Data types:\n", df.dtypes)

# Describe the DataFrame
print("Statistical Summary:\n", df.describe())

## Group by a column and perfrom an aggregation
grouped = df.groupby('Product Category')['Unit Price'].mean()
print("Mean value by category:\n", grouped)

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical Summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000
Mean value by category:
 Product Category
Beauty Products     61.6230
Books               16.1530
Clothing            67.5365
Electronics        691.5915
Home Appliances    320.1855
Sports             261.2840
Name: Unit Price, dtype: float64

In [52]:
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [54]:
# Display the data types of each column
print("Data types:\n", df.dtypes)

# Describe the DataFrame
print("Statistical Summary:\n", df.describe())

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical Summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [55]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000